---
kind: property
id: P:Autodesk.Revit.DB.CurveElement.CenterPointReference
source: html/8e17164e-f2d0-828d-8fe2-9720fec91303.htm
---
# Autodesk.Revit.DB.CurveElement.CenterPointReference Property

Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.

## Syntax (C#)
```csharp
public Reference CenterPointReference { get; }
```

## Remarks
Use this reference property when using the API to dimension between centerpoints of curves.